globalThis.ZHUYIN_KEY_MAP = Object.freeze({
  // ㄅ ㄆ ㄇ ㄈ
  "1": "ㄅ",
  "q": "ㄆ",
  "a": "ㄇ",
  "z": "ㄈ",

  // ㄉ ㄊ ㄋ ㄌ
  "2": "ㄉ",
  "w": "ㄊ",
  "s": "ㄋ",
  "x": "ㄌ",

  // ㄍ ㄎ ㄏ
  "e": "ㄍ",
  "d": "ㄎ",
  "c": "ㄏ",

  // ㄐ ㄑ ㄒ
  "r": "ㄐ",
  "f": "ㄑ",
  "v": "ㄒ",

  // ㄓ ㄔ ㄕ ㄖ
  "5": "ㄓ",
  "t": "ㄔ",
  "g": "ㄕ",
  "b": "ㄖ",

  // ㄗ ㄘ ㄙ
  "y": "ㄗ",
  "h": "ㄘ",
  "n": "ㄙ",

  // ㄧ ㄨ ㄩ
  "u": "ㄧ",
  "j": "ㄨ",
  "m": "ㄩ",

  // ㄚ ㄛ ㄜ ㄝ
  "8": "ㄚ",
  "i": "ㄛ",
  "k": "ㄜ",
  ",": "ㄝ",

  // ㄞ ㄟ ㄠ ㄡ
  "9": "ㄞ",
  "o": "ㄟ",
  "l": "ㄠ",
  ".": "ㄡ",

  // ㄢ ㄣ ㄤ ㄥ ㄦ
  "0": "ㄢ",
  "p": "ㄣ",
  ";": "ㄤ",
  "/": "ㄥ",
  "-": "ㄦ",

  // 聲調
  "6": "ˊ",
  "3": "ˇ",
  "4": "ˋ",
  "7": "˙"
});